电脑/emacs/elisp学习笔记.org
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS:[11pt,oneside]
#+LATEX_HEADER: \usepackage{article}


#+TITLE: 编写emacs插件
#+AUTHOR: 万泽(德山书生)
#+CREATOR: wanze(<a href="mailto:a358003542@gmail.com">a358003542@gmail.com</a>)
#+DESCRIPTION: 制作者邮箱：a358003542@gmail.com


* 前言
编写emacs插件的过程实际上就是熟悉elisp这门语言的过程。lisp语言在很多方面都和我们接触的其他大部分语言与众不同。要理解这点最关键的就是要理解lisp语言的链表数据结构。

因为我以前折腾过一段时间的common-lisp了，所以下面的谈论就大致回顾一下lisp的最核心的一些特性（也不会拘泥于某些语法细节）:

lisp语言里面最基本的元素是atom的，是atom类型的元素可以直接eval，你可以在emacs下输入 ~M-x ielm~ 来进入elisp的交互环境试着输入 1 或者 "abc" 来看一下。你可以如下来看看某个元素是不是数字:

#+BEGIN_SRC emacs-lisp
ELISP> (numberp 1.1)
t
#+END_SRC

类似的我们有 ~stringp~ 来判断目标元素是不是字符串。lisp的 ~t~ 和 ~nil~ 就是布尔真和布尔假。然后空表()也表示nil，然后其他所有东西都看作真。除开上面讲的有具体值atom元素，第二大类元素就是符号(symbol)，所谓symbol就是你在lisp里面简单输入一个x，其就是一个符号，这个符号具体的值可以对应为某个函数，或者某个值。

然后接下来lisp的第二大概念就是列表，lisp的一个表达式就是一个列表。比如:
#+BEGIN_SRC emacs-lisp
ELISP> (+ 2 5)
7
ELISP> (* 5 5)
25
#+END_SRC

若这个列表被eval执行，也就是如上输入，则该列表第一个元素总认为是一个函数，然后后面的都是该函数的各个参数。具体函数定义细节这里略过。

** quote函数
在lisp系统中，quote是一个特殊的函数，其意思是:
#+BEGIN_EXAMPLE
(eval (quote x)) = x
#+END_EXAMPLE

也就是后面的元素跳过eval，直接返回自身。上面的 (quote x) 还有一种简写形式 'x ，你可以直接输入'x来返回某个符号对象。

#+BEGIN_SRC emacs-lisp
ELISP> 'x
x
ELISP> '(1 2 3)
(1 2 3)
#+END_SRC

这里需要读者深刻理解，因为在lisp语言中，任何一个列表都将被eval的，而具体就是递归遍历列表内的各个元素，将各个元素都求出值出来，这里所谓的求出值，就是最终元素为上面讲的atom元素类型，或者数字或者字符串。如果是列表套列表结构（或者说得不规范点，括号套括号结构），那么里面的子列表可以看作大列表内的子元素，然后其又将继续eval之。如此递归循环，直到得出某个结果。然后对于每个列表的eval都将其内的第一个元素视作函数。

因此quote函数被lisp语言里面广泛使用，被用作表达本符号自身，然后出了第一个eval列表之后，到达父列表，其就是x也就是被eval出该符号对应的值了。所以我们也可以把引用包装某个符号看作将该符号的值传递给父环境列表中。

因为其他编程语言的列表和lisp语言里面的列表相去甚远，所以最好称之为链表。下面将介绍一下lisp语言的链表结构，理解这点对于理解lisp语言和编程模式是很关键的。


** 链表结构
本小节的例子使用的是common-lisp，但这里具体是要理解lisp语言底层的链表结构，这一点各个lisp方言包括emacs-lisp都是一致的。

首先推荐读者到 [[http://www.cs.cmu.edu/~dst/Lisp/sdraw/sdraw.generic][这里]] 下载该网页文件保存为 ~sdraw.lisp~ 。然后在slime中加载如下所示:
#+BEGIN_SRC lisp
CL-USER> (load "~/sdraw.lisp")
;; Loading file /home/wanze/sdraw.lisp ...
;; Loaded file /home/wanze/sdraw.lisp
T
CL-USER> (sdraw '("a"))

[*|*]--->NIL
 |
 v
"a"
; No value
#+END_SRC

这里 *load* 函数就是加载某个lisp脚本，这个lisp脚本提供了一个 *sdraw* 函数，其可以画出你给出的链表的结构图，是个不错的工具。

我们看到上面的例子，链表("a")里面就一个元素，其实际上是由两个部分组成的，第一个是car，也就是链表头，第二个是cdr，也就是链表尾。如下所示:

#+BEGIN_SRC lisp
CL-USER> (car '("a"))
"a"
CL-USER> (cdr '("a"))
NIL
CL-USER> 
#+END_SRC

然后我们再来看两个元素的情况:
#+BEGIN_SRC lisp
CL-USER> (sdraw '("a" "b"))

[*|*]--->[*|*]--->NIL
 |        |
 v        v
"a"      "b"
#+END_SRC

我们看到lisp的链表大致由叫做cons cell的东西链接起来的，这个cons cell分为两部分，一个头（car），一个尾（cdr），然后头或尾可以具体指向某个值，其中头或者尾指向某个具体的值则表明该链接终止了。一般的链表就如同上面所示，头指向某个具体的值，尾链接其他cons cell或者最终指向nil终止。但实际上还有一种结构:

#+BEGIN_SRC lisp
CL-USER> (sdraw '("a" . "b"))

[*|*]--->"b"
 |
 v
"a"
#+END_SRC


下面再贴一个链表之内还有一个链表的情况:
#+BEGIN_SRC lisp
CL-USER> (sdraw '("a" ("b" "c")))

[*|*]--->[*|*]--->NIL
 |        |
 v        v
"a"      [*|*]--->[*|*]--->NIL
          |        |
          v        v
         "b"      "c"
#+END_SRC

实际上这里所谓的 cons cell 的cons是英文单词链接concatenate的缩写，你可以如下来自己构建一个链表结构:
#+BEGIN_SRC lisp
CL-USER> (cons "a" nil)
("a")
CL-USER> (cons "a" '("b" "c"))
("a" "b" "c")
CL-USER> (cons "a" '(("b" "c")))
("a" ("b" "c"))
CL-USER> 
#+END_SRC

这里就是构建一个cons cell，car指向第一个参数，cdr指向第二个参数。

上面谈及的lisp语言系最通用的一些概念，具有普适性。然后接下来lisp编程的故事就是各种各样的函数——官方内置的或者你自己定义的了。这其中各个lisp方言之间差异就很大了。我们后面再详细讨论之。



* elisp基础
** 注释
注释用 ~;~ 符号开始。

