电脑/emacs/elisp学习笔记.html
<!DOCTYPE html>
<html>
<head>
<!-- 2015-12-29 二 15:58 -->
<meta  charset="utf-8">
<meta  name="viewport" content="width=device-width, initial-scale=1">
<title>编写emacs插件</title>
<meta  name="generator" content="Org-mode">
<meta  name="author" content="万泽(德山书生)">
<meta  name="description" content="制作者邮箱：a358003542@gmail.com"
>
</head>
<body>
<div id="content">
<header>
<h1 class="title">编写emacs插件</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline3">1. 前言</a>
<ul>
<li><a href="#orgheadline1">1.1. quote函数</a></li>
<li><a href="#orgheadline2">1.2. 链表结构</a></li>
</ul>
</li>
<li><a href="#orgheadline48">2. elisp基础</a>
<ul>
<li><a href="#orgheadline4">2.1. 注释</a></li>
<li><a href="#orgheadline5">2.2. 程序中的操作对象</a></li>
<li><a href="#orgheadline8">2.3. 类型检测</a>
<ul>
<li><a href="#orgheadline6">2.3.1. type-of</a></li>
<li><a href="#orgheadline7">2.3.2. 其他p型函数</a></li>
</ul>
</li>
<li><a href="#orgheadline11">2.4. 相等判断</a>
<ul>
<li><a href="#orgheadline9">2.4.1. eq</a></li>
<li><a href="#orgheadline10">2.4.2. equal</a></li>
</ul>
</li>
<li><a href="#orgheadline16">2.5. 定义变量</a>
<ul>
<li><a href="#orgheadline12">2.5.1. defvar</a></li>
<li><a href="#orgheadline13">2.5.2. defconst</a></li>
<li><a href="#orgheadline14">2.5.3. defcustom</a></li>
<li><a href="#orgheadline15">2.5.4. defgroup</a></li>
</ul>
</li>
<li><a href="#orgheadline17">2.6. eval-last-sexp</a></li>
<li><a href="#orgheadline18">2.7. concat函数</a></li>
<li><a href="#orgheadline19">2.8. substring函数</a></li>
<li><a href="#orgheadline20">2.9. buffer-name</a></li>
<li><a href="#orgheadline21">2.10. buffer-file-name</a></li>
<li><a href="#orgheadline22">2.11. load-file-name</a></li>
<li><a href="#orgheadline23">2.12. file-name-directory</a></li>
<li><a href="#orgheadline24">2.13. 读取某个文件内容</a></li>
<li><a href="#orgheadline25">2.14. if函数</a></li>
<li><a href="#orgheadline26">2.15. and</a></li>
<li><a href="#orgheadline27">2.16. or</a></li>
<li><a href="#orgheadline28">2.17. cond</a></li>
<li><a href="#orgheadline29">2.18. defun定义自己的函数</a></li>
<li><a href="#orgheadline30">2.19. let创建局部变量</a></li>
<li><a href="#orgheadline31">2.20. 基本lisp链表操作元函数</a></li>
<li><a href="#orgheadline35">2.21. alist和plist</a>
<ul>
<li><a href="#orgheadline32">2.21.1. plist-get</a></li>
<li><a href="#orgheadline33">2.21.2. assoc</a></li>
<li><a href="#orgheadline34">2.21.3. assq</a></li>
</ul>
</li>
<li><a href="#orgheadline36">2.22. reverse函数</a></li>
<li><a href="#orgheadline37">2.23. nth</a></li>
<li><a href="#orgheadline38">2.24. nthcdr</a></li>
<li><a href="#orgheadline39">2.25. last</a></li>
<li><a href="#orgheadline40">2.26. remove</a></li>
<li><a href="#orgheadline47">2.27. 集合相关函数</a>
<ul>
<li><a href="#orgheadline41">2.27.1. member</a></li>
<li><a href="#orgheadline42">2.27.2. intersection</a></li>
<li><a href="#orgheadline43">2.27.3. union</a></li>
<li><a href="#orgheadline44">2.27.4. set-difference</a></li>
<li><a href="#orgheadline45">2.27.5. subsetp</a></li>
<li><a href="#orgheadline46">2.27.6. set-exclusive-or</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline76">3. elisp进阶</a>
<ul>
<li><a href="#orgheadline49">3.1. current-buffer</a></li>
<li><a href="#orgheadline50">3.2. other-buffer</a></li>
<li><a href="#orgheadline51">3.3. switch-to-buffer</a></li>
<li><a href="#orgheadline52">3.4. buffer-size</a></li>
<li><a href="#orgheadline53">3.5. point对象</a></li>
<li><a href="#orgheadline54">3.6. interactive</a></li>
<li><a href="#orgheadline55">3.7. save-excursion</a></li>
<li><a href="#orgheadline56">3.8. next-line</a></li>
<li><a href="#orgheadline57">3.9. mark-whole-buffer</a></li>
<li><a href="#orgheadline58">3.10. subst</a></li>
<li><a href="#orgheadline59">3.11. sublis</a></li>
<li><a href="#orgheadline60">3.12. funcall</a></li>
<li><a href="#orgheadline61">3.13. mapcar</a></li>
<li><a href="#orgheadline62">3.14. lambda</a></li>
<li><a href="#orgheadline63">3.15. find-if</a></li>
<li><a href="#orgheadline64">3.16. remove-if-not</a></li>
<li><a href="#orgheadline65">3.17. remove-if</a></li>
<li><a href="#orgheadline66">3.18. reduce</a></li>
<li><a href="#orgheadline67">3.19. every</a></li>
<li><a href="#orgheadline68">3.20. incf</a></li>
<li><a href="#orgheadline69">3.21. decf</a></li>
<li><a href="#orgheadline70">3.22. push</a></li>
<li><a href="#orgheadline71">3.23. pop</a></li>
<li><a href="#orgheadline72">3.24. when</a></li>
<li><a href="#orgheadline73">3.25. unless</a></li>
<li><a href="#orgheadline74">3.26. dotimes 和dolist函数</a></li>
<li><a href="#orgheadline75">3.27. 理解递归</a></li>
</ul>
</li>
<li><a href="#orgheadline77">4. 定义自己的包</a></li>
<li><a href="#orgheadline81">5. 附录</a>
<ul>
<li><a href="#orgheadline78">5.1. emacs中使用common-lisp</a></li>
<li><a href="#orgheadline79">5.2. 命令行执行emacs里面的命令</a></li>
<li><a href="#orgheadline80">5.3. 参考资料</a></li>
</ul>
</li>
</ul>
</div>
</nav>


<div class="outline-2">
<h2 id="orgheadline3">前言</h2>
<div class="outline-text-2" id="text-1">
<p>
编写emacs插件的过程实际上就是熟悉elisp这门语言的过程。lisp语言在很多方面都和我们接触的其他大部分语言与众不同。要理解这点最关键的就是要理解lisp语言的链表数据结构。
</p>

<p>
因为我以前折腾过一段时间的common-lisp了，所以下面的谈论就大致回顾一下lisp的最核心的一些特性（也不会拘泥于某些语法细节）:
</p>

<p>
lisp语言里面最基本的元素是atom的，是atom类型的元素可以直接eval，你可以在emacs下输入 <code>M-x ielm</code> 来进入elisp的交互环境试着输入 1 或者 "abc" 来看一下。你可以如下来看看某个元素是不是数字:
</p>

<div class="highlight"><pre><span class="nv">ELISP&gt;</span> <span class="p">(</span><span class="nb">numberp</span> <span class="mf">1.1</span><span class="p">)</span>
<span class="no">t</span>
</pre></div>

<p>
类似的我们有 <code>stringp</code> 来判断目标元素是不是字符串。lisp的 <code>t</code> 和 <code>nil</code> 就是布尔真和布尔假。然后空表()也表示nil，然后其他所有东西都看作真。除开上面讲的有具体值atom元素，第二大类元素就是符号(symbol)，所谓symbol就是你在lisp里面简单输入一个x，其就是一个符号，这个符号具体的值可以对应为某个函数，或者某个值。
</p>

<p>
然后接下来lisp的第二大概念就是列表，lisp的一个表达式就是一个列表。比如:
</p>
<div class="highlight"><pre><span class="nv">ELISP&gt;</span> <span class="p">(</span><span class="nb">+</span> <span class="mi">2</span> <span class="mi">5</span><span class="p">)</span>
<span class="mi">7</span>
<span class="nv">ELISP&gt;</span> <span class="p">(</span><span class="nb">*</span> <span class="mi">5</span> <span class="mi">5</span><span class="p">)</span>
<span class="mi">25</span>
</pre></div>

<p>
若这个列表被eval执行，也就是如上输入，则该列表第一个元素总认为是一个函数，然后后面的都是该函数的各个参数。具体函数定义细节这里略过。
</p>
</div>

<div class="outline-3">
<h3 id="orgheadline1">quote函数</h3>
<div class="outline-text-3" id="text-1-1">
<p>
在lisp系统中，quote是一个特殊的函数，其意思是:
</p>
<pre>
(eval (quote x)) = x
</pre>

<p>
也就是后面的元素跳过eval，直接返回自身。上面的 (quote x) 还有一种简写形式 'x ，你可以直接输入'x来返回某个符号对象。
</p>

<div class="highlight"><pre><span class="nv">ELISP&gt;</span> <span class="ss">&#39;x</span>
<span class="nv">x</span>
<span class="nv">ELISP&gt;</span> <span class="o">&#39;</span><span class="p">(</span><span class="mi">1</span> <span class="mi">2</span> <span class="mi">3</span><span class="p">)</span>
<span class="p">(</span><span class="mi">1</span> <span class="mi">2</span> <span class="mi">3</span><span class="p">)</span>
</pre></div>

<p>
这里需要读者深刻理解，因为在lisp语言中，任何一个列表都将被eval的，而具体就是递归遍历列表内的各个元素，将各个元素都求出值出来，这里所谓的求出值，就是最终元素为上面讲的atom元素类型，或者数字或者字符串。如果是列表套列表结构（或者说得不规范点，括号套括号结构），那么里面的子列表可以看作大列表内的子元素，然后其又将继续eval之。如此递归循环，直到得出某个结果。然后对于每个列表的eval都将其内的第一个元素视作函数。
</p>

<p>
因此quote函数被lisp语言里面广泛使用，被用作表达本符号自身，然后出了第一个eval列表之后，到达父列表，其就是x也就是被eval出该符号对应的值了。所以我们也可以把引用包装某个符号看作将该符号的值传递给父环境列表中。
</p>

<p>
因为其他编程语言的列表和lisp语言里面的列表相去甚远，所以最好称之为链表。下面将介绍一下lisp语言的链表结构，理解这点对于理解lisp语言和编程模式是很关键的。
</p>
</div>
</div>


<div class="outline-3">
<h3 id="orgheadline2">链表结构</h3>
<div class="outline-text-3" id="text-1-2">
<p>
本小节的例子使用的是common-lisp，但这里具体是要理解lisp语言底层的链表结构，这一点各个lisp方言包括emacs-lisp都是一致的。
</p>

<p>
首先推荐读者到 <a href="http://www.cs.cmu.edu/~dst/Lisp/sdraw/sdraw.generic">这里</a> 下载该网页文件保存为 <code>sdraw.lisp</code> 。然后在slime中加载如下所示:
</p>
<div class="highlight"><pre><span class="nv">CL-USER&gt;</span> <span class="p">(</span><span class="nb">load</span> <span class="s">&quot;~/sdraw.lisp&quot;</span><span class="p">)</span>
<span class="c1">;; Loading file /home/wanze/sdraw.lisp ...</span>
<span class="c1">;; Loaded file /home/wanze/sdraw.lisp</span>
<span class="no">T</span>
<span class="nv">CL-USER&gt;</span> <span class="p">(</span><span class="nv">sdraw</span> <span class="o">&#39;</span><span class="p">(</span><span class="s">&quot;a&quot;</span><span class="p">))</span>

<span class="nv">[*|*]---&gt;NIL</span>
<span class="nv"> |</span>
 <span class="nv">v</span>
<span class="s">&quot;a&quot;</span>
<span class="c1">; No value</span>
</pre></div>

<p>
这里 <strong>load</strong> 函数就是加载某个lisp脚本，这个lisp脚本提供了一个 <strong>sdraw</strong> 函数，其可以画出你给出的链表的结构图，是个不错的工具。
</p>

<p>
我们看到上面的例子，链表("a")里面就一个元素，其实际上是由两个部分组成的，第一个是car，也就是链表头，第二个是cdr，也就是链表尾。如下所示:
</p>

<div class="highlight"><pre><span class="nv">CL-USER&gt;</span> <span class="p">(</span><span class="nb">car</span> <span class="o">&#39;</span><span class="p">(</span><span class="s">&quot;a&quot;</span><span class="p">))</span>
<span class="s">&quot;a&quot;</span>
<span class="nv">CL-USER&gt;</span> <span class="p">(</span><span class="nb">cdr</span> <span class="o">&#39;</span><span class="p">(</span><span class="s">&quot;a&quot;</span><span class="p">))</span>
<span class="no">NIL</span>
<span class="nv">CL-USER&gt;</span>
</pre></div>

<p>
然后我们再来看两个元素的情况:
</p>
<div class="highlight"><pre><span class="nv">CL-USER&gt;</span> <span class="p">(</span><span class="nv">sdraw</span> <span class="o">&#39;</span><span class="p">(</span><span class="s">&quot;a&quot;</span> <span class="s">&quot;b&quot;</span><span class="p">))</span>

<span class="nv">[*|*]---&gt;[*|*]---&gt;NIL</span>
 <span class="nv">|        |</span>
 <span class="nv">v</span>        <span class="nv">v</span>
<span class="s">&quot;a&quot;</span>      <span class="s">&quot;b&quot;</span>
</pre></div>

<p>
我们看到lisp的链表大致由叫做cons cell的东西链接起来的，这个cons cell分为两部分，一个头（car），一个尾（cdr），然后头或尾可以具体指向某个值，其中头或者尾指向某个具体的值则表明该链接终止了。一般的链表就如同上面所示，头指向某个具体的值，尾链接其他cons cell或者最终指向nil终止。但实际上还有一种结构:
</p>

<div class="highlight"><pre><span class="nv">CL-USER&gt;</span> <span class="p">(</span><span class="nv">sdraw</span> <span class="o">&#39;</span><span class="p">(</span><span class="s">&quot;a&quot;</span> <span class="o">.</span> <span class="s">&quot;b&quot;</span><span class="p">))</span>

<span class="nv">[*|*]---&gt;&quot;b&quot;</span>
<span class="nv"> |</span>
 <span class="nv">v</span>
<span class="s">&quot;a&quot;</span>
</pre></div>


<p>
下面再贴一个链表之内还有一个链表的情况:
</p>
<div class="highlight"><pre><span class="nv">CL-USER&gt;</span> <span class="p">(</span><span class="nv">sdraw</span> <span class="o">&#39;</span><span class="p">(</span><span class="s">&quot;a&quot;</span> <span class="p">(</span><span class="s">&quot;b&quot;</span> <span class="s">&quot;c&quot;</span><span class="p">)))</span>

<span class="nv">[*|*]---&gt;[*|*]---&gt;NIL</span>
 <span class="nv">|        |</span>
 <span class="nv">v</span>        <span class="nv">v</span>
<span class="s">&quot;a&quot;</span>      <span class="nv">[*|*]---&gt;[*|*]---&gt;NIL</span>
          <span class="nv">|        |</span>
          <span class="nv">v</span>        <span class="nv">v</span>
         <span class="s">&quot;b&quot;</span>      <span class="s">&quot;c&quot;</span>
</pre></div>

<p>
实际上这里所谓的 cons cell 的cons是英文单词链接concatenate的缩写，你可以如下来自己构建一个链表结构:
</p>
<div class="highlight"><pre><span class="nv">CL-USER&gt;</span> <span class="p">(</span><span class="nb">cons</span> <span class="s">&quot;a&quot;</span> <span class="no">nil</span><span class="p">)</span>
<span class="p">(</span><span class="s">&quot;a&quot;</span><span class="p">)</span>
<span class="nv">CL-USER&gt;</span> <span class="p">(</span><span class="nb">cons</span> <span class="s">&quot;a&quot;</span> <span class="o">&#39;</span><span class="p">(</span><span class="s">&quot;b&quot;</span> <span class="s">&quot;c&quot;</span><span class="p">))</span>
<span class="p">(</span><span class="s">&quot;a&quot;</span> <span class="s">&quot;b&quot;</span> <span class="s">&quot;c&quot;</span><span class="p">)</span>
<span class="nv">CL-USER&gt;</span> <span class="p">(</span><span class="nb">cons</span> <span class="s">&quot;a&quot;</span> <span class="o">&#39;</span><span class="p">((</span><span class="s">&quot;b&quot;</span> <span class="s">&quot;c&quot;</span><span class="p">)))</span>
<span class="p">(</span><span class="s">&quot;a&quot;</span> <span class="p">(</span><span class="s">&quot;b&quot;</span> <span class="s">&quot;c&quot;</span><span class="p">))</span>
<span class="nv">CL-USER&gt;</span>
</pre></div>

<p>
这里就是构建一个cons cell，car指向第一个参数，cdr指向第二个参数。
</p>

<p>
上面谈及的lisp语言系最通用的一些概念，具有普适性。然后接下来lisp编程的故事就是各种各样的函数——官方内置的或者你自己定义的了。这其中各个lisp方言之间差异就很大了。我们后面再详细讨论之。
</p>
</div>
</div>
</div>
