电脑/emacs/elisp学习笔记.org
** 程序中的操作对象
- integer float 同样存在数值范围限制，这个程序员注意点就可以了

- character 这个比较特殊，不是 'a' 这样的表达，而是 ?a 这样的输入，然后字符实际上就是一个数值，此外特殊的字符还有:
#+BEGIN_EXAMPLE
?\a ⇒ 7    ; control-g, C-g
?\b ⇒ 8    ; backspace, BS, C-h
?\t ⇒ 9    ; tab, TAB, C-i
?\n ⇒ 10   ; newline, C-j
?\v ⇒ 11   ; vertical tab, C-k
?\f ⇒ 12   ; formfeed character, C-l
?\r ⇒ 13   ; carriage return, RET, C-m
?\e ⇒ 27   ; escape character, ESC, C-[
?\s ⇒ 32   ; space character, SPC
?\\ ⇒ 92   ; backslash character, \
?\d ⇒ 127  ; delete character, DEL
#+END_EXAMPLE

特殊符号的转义，这些符号应该用 \ 来进行转义:
#+BEGIN_EXAMPLE
( ) \ | ; " # . , 
#+END_EXAMPLE
官方文档还有单左引号和单右引号 ’‘ ，似乎在英文中并没使用这两个符号啊？

- symbol 可以看作其他语言的变量名

- sequence 其包括 list（） 和 array（arrayp） 。array是定长数组，其又可以分为: string vector char-table（char-table-p） bool-table 。sequence不可以读两次？
  - string 一大段字符串可以用 \ 换行  char-or-string-p
  - vertor  
    #+BEGIN_EXAMPLE
    ELISP> [1 2 3]
    [1 2 3]
    #+END_EXAMPLE
     
bool-vector-p

- cons cell 结构，这个就是lisp语言的底层了。 consp
- dotted pair notation 其实也是一种更 cons cell 结构，只是两端都有值 (a . b)
- association list  基于前面的dotted pair notation:


** 类型检测
*** type-of

*** 其他p型函数
atom
arrayp
bool-vector-p
bufferp
byte-code-function-p
case-table-p
char-or-string-p
char-table-p
commandp 
consp 
custom-variable-p
display-table-p
floatp
fontp
frame-configuration-p
frame-live-p
framep
functionp
hash-table-p
integer-or-marker-p
integerp
keymapp 
keywordp
listp 
markerp
wholenump
nlistp 
numberp 
number-or-marker-p
overlayp
processp
sequencep
stringp 
subrp 
symbolp
syntax-table-p
vectorp
window-configuration-p
window-live-p
windowp 
booleanp
string-or-null-p


** 相等判断
相等判断：equal   eq   eql  =  equalp
eq是运算最快的了，它只比较地址。
equal比较内容。
eql类似eq，比较地址，还专门针对不同类型的数字。
= 专门针对不同类型的数字
equalp和equal差不多，但是忽略字符中的大小写。



*** eq
test if the same object
#+BEGIN_EXAMPLE
(eq object1 object2)
#+END_EXAMPLE

*** equal
test if has the same components
#+BEGIN_EXAMPLE
(equal object1 object2)
#+END_EXAMPLE

equal-including-properties object1 object2


** 定义变量
setq是最基本的，上面已经有所介绍了。然后是defvar和defconst，一般推荐使用defvar和defconst，其中defvar用于声明变量，然后defconst用于声明常量，此外还有defcustom，defcustom比较复杂，等下再详细讨论，其和defvar，defconst的区别是defcustom适用于接口开放给用户的变量，好方便用户来定制。defvar和defconst和setq的区别是其可以接受一段字符串作为自身的描述信息，所以一般推荐使用这个。然后这几个本质上应该都是基于setq的，也就是都是定义的全局变量。

*** defvar
#+BEGIN_EXAMPLE
defvar symbol [ value [ doc-string ]]
#+END_EXAMPLE

*** defconst
#+BEGIN_EXAMPLE
defconst symbol value [ doc-string ]
#+END_EXAMPLE



*** defcustom
defcustom参数和defvar比较起来多了一些可选项关键词参数可以填，然后前面三个意思是变量名字，初始值和说明文档。
#+BEGIN_EXAMPLE
defcustom option standard doc [ keyword value ]
#+END_EXAMPLE

凡是需要对外开放给用户配置的变量都推荐使用defcustom，然后通过 ~custom-set-variables~ 来配置这些变量。如下所示:
#+BEGIN_EXAMPLE
(custom-set-variables
 '(cua-mode t nil (cua-base))
 '(custom-enabled-themes (quote (tango-dark))))
#+END_EXAMPLE

~custom-set-variables~ 里面定制的格式，第一个是变量名，第二个是具体的值，这都是好理解的。然后后面是一些可选的参数，now request和comment。其中now如果non-nil则该变量的值没有evaluate也进行赋值，然后request是一个feature列表，这个后面再说。comment就是一些定制说明了。



defcustom的大致格式如下:
#+BEGIN_EXAMPLE
(defcustom org-html-use-infojs 'when-configured
  "Non-nil when Sebastian Rose's Java Script org-info.js should be active.
This option can be nil or t to never or always use the script.
It can also be the symbol `when-configured', meaning that the
script will be linked into the export file if and only if there
is a \"#+INFOJS_OPT:\" line in the buffer.  See also the variable
`org-html-infojs-options'."
  :group 'org-export-html
  :version "24.4"
  :package-version '(Org . "8.0")
  :type '(choice
	  (const :tag "Never" nil)
	  (const :tag "When configured in buffer" when-configured)
	  (const :tag "Always" t)))
#+END_EXAMPLE

每一个关键词前面都应该加上 ~:~ ，下面详细讨论这些关键词:

- :type 数据类型定义
- :options 关于该变量的一系列的建议值
- :group 该变量属于那个群组


*** defgroup
定义一个群组
#+BEGIN_EXAMPLE
defgroup group members doc [ keyword value ]
#+END_EXAMPLE

如果其接受 :group ，则表示该群组属于那个群组。


** eval-last-sexp
eval最后一个s表达式，这个快捷键很常用 ~C-x C-e~ ，用来执行最后一个S表达式，方便快速测试。然后还有 ~C-:~ 在minibuffer下进行互动。比如下面写上这么一行，然后在行尾执行 ~C-x C-e~

(defun hello () (message "hello world"))

这个定义的hello命令就进入elisp环境了，然后输入 ~C-:~ ，在minibuffer下来输入 (hello) 来看一下效果。



** concat函数
字符串拼接函数
(concat "abc" "abc")


** substring函数
(substring "test" 0 2)
相当于python的 "test"[0:2]

** buffer-name
(buffer-name)
目前buffer的name

** buffer-file-name
(buffer-file-name)
目前buffer在系统的中的文件路径名



** load-file-name
load-file-name 返回该脚本所在的文件路径名，参考了 [[http://stackoverflow.com/questions/4088681/get-path-to-current-emacs-script-file-when-loaded-with-l-parameter][这个网页]] 。

** file-name-directory
如下面的代码将返回本脚本所在的目录路径，字符串形式。
#+BEGIN_SRC emacs-lisp
(file-name-directory load-file-name)
#+END_SRC

如果你需要将这个值存储进某个变量中，那么推荐使用defvar或defcustom。


** 读取某个文件内容
参考了 [[http://ergoemacs.org/emacs/elisp_read_file_content.html][这个网页]] 。

#+BEGIN_SRC emacs-lisp
(defun get-string-from-file (filePath)
  "Return filePath's file content."
  (with-temp-buffer
    (insert-file-contents filePath)
    (buffer-string)))
#+END_SRC


** if函数
if函数最简单的理解如下所示:
#+BEGIN_SRC lisp
CL-USER> (if t 5 3)
5
CL-USER> (if nil 5 3)
3
CL-USER> 
#+END_SRC
如果第二个元素估值为t，则返回第三个元素的值，如果是nil则返回第四个元素的值。然后第四个元素可以不填，也就是nil的时候什么都不做或者说返回nil。

** and
and是先evaluate一个，如果是真，那么going on to evaluate，如果是nil，那么返回nil。
and还有一个有趣的性质，那就是如果都为真，那么最后返回的不是t，而是最后那个信息的结果。


** or
or是先evaluate一个，如果是真就report，同样返回这个信息的结果，如果是nil，keep going on to search。
(or nil nil 'apple 'blue)---->apple


** cond
cond函数相当于c语言的switch语句。


