电脑/emacs/elisp学习笔记.html



<div class="outline-2">
<h2 id="orgheadline48">elisp基础</h2>
<div class="outline-text-2" id="text-2">
</div><div class="outline-3">
<h3 id="orgheadline4">注释</h3>
<div class="outline-text-3" id="text-2-1">
<p>
注释用 <code>;</code> 符号开始。
</p>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline5">程序中的操作对象</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>integer float 同样存在数值范围限制，这个程序员注意点就可以了</li>

<li>character 这个比较特殊，不是 'a' 这样的表达，而是 ?a 这样的输入，然后字符实际上就是一个数值，此外特殊的字符还有:</li>
</ul>
<pre>
?\a ⇒ 7    ; control-g, C-g
?\b ⇒ 8    ; backspace, BS, C-h
?\t ⇒ 9    ; tab, TAB, C-i
?\n ⇒ 10   ; newline, C-j
?\v ⇒ 11   ; vertical tab, C-k
?\f ⇒ 12   ; formfeed character, C-l
?\r ⇒ 13   ; carriage return, RET, C-m
?\e ⇒ 27   ; escape character, ESC, C-[
?\s ⇒ 32   ; space character, SPC
?\\ ⇒ 92   ; backslash character, \
?\d ⇒ 127  ; delete character, DEL
</pre>

<p>
特殊符号的转义，这些符号应该用 \ 来进行转义:
</p>
<pre>
( ) \ | ; " # . ,
</pre>
<p>
官方文档还有单左引号和单右引号 ’‘ ，似乎在英文中并没使用这两个符号啊？
</p>

<ul class="org-ul">
<li>symbol 可以看作其他语言的变量名</li>

<li>sequence 其包括 list（） 和 array（arrayp） 。array是定长数组，其又可以分为: string vector char-table（char-table-p） bool-table 。sequence不可以读两次？
<ul class="org-ul">
<li>string 一大段字符串可以用 \ 换行  char-or-string-p</li>
<li><p>
vertor  
</p>
<pre>
ELISP&gt; [1 2 3]
[1 2 3]
</pre></li>
</ul></li>
</ul>

<p>
bool-vector-p
</p>

<ul class="org-ul">
<li>cons cell 结构，这个就是lisp语言的底层了。 consp</li>
<li>dotted pair notation 其实也是一种更 cons cell 结构，只是两端都有值 (a . b)</li>
<li>association list  基于前面的dotted pair notation:</li>
</ul>
</div>
</div>


<div class="outline-3">
<h3 id="orgheadline8">类型检测</h3>
<div class="outline-text-3" id="text-2-3">
</div><div class="outline-4">
<h4 id="orgheadline6">type-of</h4>
</div>

<div class="outline-4">
<h4 id="orgheadline7">其他p型函数</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
atom
arrayp
bool-vector-p
bufferp
byte-code-function-p
case-table-p
char-or-string-p
char-table-p
commandp 
consp 
custom-variable-p
display-table-p
floatp
fontp
frame-configuration-p
frame-live-p
framep
functionp
hash-table-p
integer-or-marker-p
integerp
keymapp 
keywordp
listp 
markerp
wholenump
nlistp 
numberp 
number-or-marker-p
overlayp
processp
sequencep
stringp 
subrp 
symbolp
syntax-table-p
vectorp
window-configuration-p
window-live-p
windowp 
booleanp
string-or-null-p
</p>
</div>
</div>
</div>


<div class="outline-3">
<h3 id="orgheadline11">相等判断</h3>
<div class="outline-text-3" id="text-2-4">
<p>
相等判断：equal   eq   eql  =  equalp
eq是运算最快的了，它只比较地址。
equal比较内容。
eql类似eq，比较地址，还专门针对不同类型的数字。
= 专门针对不同类型的数字
equalp和equal差不多，但是忽略字符中的大小写。
</p>
</div>



<div class="outline-4">
<h4 id="orgheadline9">eq</h4>
<div class="outline-text-4" id="text-2-4-1">
<p>
test if the same object
</p>
<pre>
(eq object1 object2)
</pre>
</div>
</div>

<div class="outline-4">
<h4 id="orgheadline10">equal</h4>
<div class="outline-text-4" id="text-2-4-2">
<p>
test if has the same components
</p>
<pre>
(equal object1 object2)
</pre>

<p>
equal-including-properties object1 object2
</p>
</div>
</div>
</div>


<div class="outline-3">
<h3 id="orgheadline16">定义变量</h3>
<div class="outline-text-3" id="text-2-5">
<p>
setq是最基本的，上面已经有所介绍了。然后是defvar和defconst，一般推荐使用defvar和defconst，其中defvar用于声明变量，然后defconst用于声明常量，此外还有defcustom，defcustom比较复杂，等下再详细讨论，其和defvar，defconst的区别是defcustom适用于接口开放给用户的变量，好方便用户来定制。defvar和defconst和setq的区别是其可以接受一段字符串作为自身的描述信息，所以一般推荐使用这个。然后这几个本质上应该都是基于setq的，也就是都是定义的全局变量。
</p>
</div>

<div class="outline-4">
<h4 id="orgheadline12">defvar</h4>
<div class="outline-text-4" id="text-2-5-1">
<pre>
defvar symbol [ value [ doc-string ]]
</pre>
</div>
</div>

<div class="outline-4">
<h4 id="orgheadline13">defconst</h4>
<div class="outline-text-4" id="text-2-5-2">
<pre>
defconst symbol value [ doc-string ]
</pre>
</div>
</div>



<div class="outline-4">
<h4 id="orgheadline14">defcustom</h4>
<div class="outline-text-4" id="text-2-5-3">
<p>
defcustom参数和defvar比较起来多了一些可选项关键词参数可以填，然后前面三个意思是变量名字，初始值和说明文档。
</p>
<pre>
defcustom option standard doc [ keyword value ]
</pre>

<p>
凡是需要对外开放给用户配置的变量都推荐使用defcustom，然后通过 <code>custom-set-variables</code> 来配置这些变量。如下所示:
</p>
<pre>
(custom-set-variables
 '(cua-mode t nil (cua-base))
 '(custom-enabled-themes (quote (tango-dark))))
</pre>

<p>
<code>custom-set-variables</code> 里面定制的格式，第一个是变量名，第二个是具体的值，这都是好理解的。然后后面是一些可选的参数，now request和comment。其中now如果non-nil则该变量的值没有evaluate也进行赋值，然后request是一个feature列表，这个后面再说。comment就是一些定制说明了。
</p>



<p>
defcustom的大致格式如下:
</p>
<pre>
(defcustom org-html-use-infojs 'when-configured
  "Non-nil when Sebastian Rose's Java Script org-info.js should be active.
This option can be nil or t to never or always use the script.
It can also be the symbol `when-configured', meaning that the
script will be linked into the export file if and only if there
is a \"#+INFOJS_OPT:\" line in the buffer.  See also the variable
`org-html-infojs-options'."
  :group 'org-export-html
  :version "24.4"
  :package-version '(Org . "8.0")
  :type '(choice
	  (const :tag "Never" nil)
	  (const :tag "When configured in buffer" when-configured)
	  (const :tag "Always" t)))
</pre>

<p>
每一个关键词前面都应该加上 <code>:</code> ，下面详细讨论这些关键词:
</p>

<ul class="org-ul">
<li>:type 数据类型定义</li>
<li>:options 关于该变量的一系列的建议值</li>
<li>:group 该变量属于那个群组</li>
</ul>
</div>
</div>


<div class="outline-4">
<h4 id="orgheadline15">defgroup</h4>
<div class="outline-text-4" id="text-2-5-4">
<p>
定义一个群组
</p>
<pre>
defgroup group members doc [ keyword value ]
</pre>

<p>
如果其接受 :group ，则表示该群组属于那个群组。
</p>
</div>
</div>
</div>


<div class="outline-3">
<h3 id="orgheadline17">eval-last-sexp</h3>
<div class="outline-text-3" id="text-2-6">
<p>
eval最后一个s表达式，这个快捷键很常用 <code>C-x C-e</code> ，用来执行最后一个S表达式，方便快速测试。然后还有 <code>C-:</code> 在minibuffer下进行互动。比如下面写上这么一行，然后在行尾执行 <code>C-x C-e</code>
</p>

<p>
(defun hello () (message "hello world"))
</p>

<p>
这个定义的hello命令就进入elisp环境了，然后输入 <code>C-:</code> ，在minibuffer下来输入 (hello) 来看一下效果。
</p>
</div>
</div>



<div class="outline-3">
<h3 id="orgheadline18">concat函数</h3>
<div class="outline-text-3" id="text-2-7">
<p>
字符串拼接函数
(concat "abc" "abc")
</p>
</div>
</div>


<div class="outline-3">
<h3 id="orgheadline19">substring函数</h3>
<div class="outline-text-3" id="text-2-8">
<p>
(substring "test" 0 2)
相当于python的 "test"[0:2]
</p>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline20">buffer-name</h3>
<div class="outline-text-3" id="text-2-9">
<p>
(buffer-name)
目前buffer的name
</p>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline21">buffer-file-name</h3>
<div class="outline-text-3" id="text-2-10">
<p>
(buffer-file-name)
目前buffer在系统的中的文件路径名
</p>
</div>
</div>



<div class="outline-3">
<h3 id="orgheadline22">load-file-name</h3>
<div class="outline-text-3" id="text-2-11">
<p>
load-file-name 返回该脚本所在的文件路径名，参考了 <a href="http://stackoverflow.com/questions/4088681/get-path-to-current-emacs-script-file-when-loaded-with-l-parameter">这个网页</a> 。
</p>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline23">file-name-directory</h3>
<div class="outline-text-3" id="text-2-12">
<p>
如下面的代码将返回本脚本所在的目录路径，字符串形式。
</p>
<div class="highlight"><pre><span class="p">(</span><span class="nv">file-name-directory</span> <span class="nv">load-file-name</span><span class="p">)</span>
</pre></div>

<p>
如果你需要将这个值存储进某个变量中，那么推荐使用defvar或defcustom。
</p>
</div>
</div>


<div class="outline-3">
<h3 id="orgheadline24">读取某个文件内容</h3>
<div class="outline-text-3" id="text-2-13">
<p>
参考了 <a href="http://ergoemacs.org/emacs/elisp_read_file_content.html">这个网页</a> 。
</p>

<div class="highlight"><pre><span class="p">(</span><span class="nb">defun</span> <span class="nv">get-string-from-file</span> <span class="p">(</span><span class="nv">filePath</span><span class="p">)</span>
  <span class="s">&quot;Return filePath&#39;s file content.&quot;</span>
  <span class="p">(</span><span class="nv">with-temp-buffer</span>
    <span class="p">(</span><span class="nv">insert-file-contents</span> <span class="nv">filePath</span><span class="p">)</span>
    <span class="p">(</span><span class="nv">buffer-string</span><span class="p">)))</span>
</pre></div>
</div>
</div>


<div class="outline-3">
<h3 id="orgheadline25">if函数</h3>
<div class="outline-text-3" id="text-2-14">
<p>
if函数最简单的理解如下所示:
</p>
<div class="highlight"><pre><span class="nv">CL-USER&gt;</span> <span class="p">(</span><span class="k">if</span> <span class="no">t</span> <span class="mi">5</span> <span class="mi">3</span><span class="p">)</span>
<span class="mi">5</span>
<span class="nv">CL-USER&gt;</span> <span class="p">(</span><span class="k">if</span> <span class="no">nil</span> <span class="mi">5</span> <span class="mi">3</span><span class="p">)</span>
<span class="mi">3</span>
<span class="nv">CL-USER&gt;</span>
</pre></div>
<p>
如果第二个元素估值为t，则返回第三个元素的值，如果是nil则返回第四个元素的值。然后第四个元素可以不填，也就是nil的时候什么都不做或者说返回nil。
</p>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline26">and</h3>
<div class="outline-text-3" id="text-2-15">
<p>
and是先evaluate一个，如果是真，那么going on to evaluate，如果是nil，那么返回nil。
and还有一个有趣的性质，那就是如果都为真，那么最后返回的不是t，而是最后那个信息的结果。
</p>
</div>
</div>


<div class="outline-3">
<h3 id="orgheadline27">or</h3>
<div class="outline-text-3" id="text-2-16">
<p>
or是先evaluate一个，如果是真就report，同样返回这个信息的结果，如果是nil，keep going on to search。
(or nil nil 'apple 'blue)-&#x2014;&gt;apple
</p>
</div>
</div>


<div class="outline-3">
<h3 id="orgheadline28">cond</h3>
<div class="outline-text-3" id="text-2-17">
<p>
cond函数相当于c语言的switch语句。
</p>
</div>
</div>
