电脑/emacs/elisp学习笔记.html


<div class="outline-3">
<h3 id="orgheadline29">defun定义自己的函数</h3>
<div class="outline-text-3" id="text-2-18">
<p>
在lisp中讲到定义函数就不得不提lambda表达式，对lambda表达式有兴趣的请上网搜索相关信息了解之。简单来说就是如这样的 <code>(lambda (x) (* x x))</code> 一种匿名函数表示方法。该列表第二项定义的该函数的入口参数，然后第三项定义的是该函数的结果返回形式。对应的通过 <strong>defun</strong> 来定义自己的函数如下所示:
</p>

<div class="highlight"><pre><span class="p">(</span><span class="nb">defun</span> <span class="nv">square</span> <span class="p">(</span><span class="nv">x</span><span class="p">)</span> <span class="p">(</span><span class="nb">*</span> <span class="nv">x</span> <span class="nv">x</span><span class="p">))</span>
</pre></div>

<p>
通过defun定义的有名函数，底层实质就是lambda函数机制，不过是给具体的那个lambda函数对象赋了一个名字罢了。我们前面说道lisp在eval一个链表的时候，其第一项将被默认认为是一个函数对象，其实质就是指向了一个lambda函数对象。
</p>

<p>
elisp下的defun多了两个内容，一是文档，其实可选的:
</p>
<pre>
(defun multiply-by-seven (number)
"Multiply NUMBER by seven."
(* 7 number))
</pre>

<p>
二是对用户接口的开放，其也是可选的，interactive函数，这个后面再谈论。
</p>
<pre>
(defun function-name (arguments...)
"optional-documentation..."
(interactive argument-passing-info)
body...)
</pre>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline30">let创建局部变量</h3>
<div class="outline-text-3" id="text-2-19">
<p>
let 主要用于创造local  variables
</p>

<p>
let 在body中遇到不认识的变量了，首先在自己内部找，如果找不到，那么在global variable中找。
然后没定义一个defun其函数内部都有自己独立的语境，即用自己的局域变量，找不到就用广义变量。还找不到就说出现错误
</p>

<p>
let*和let的区别就是一次只运算赋值一个本地变量，然后再第二个。也就是说如果第二个的赋值依赖于第一个的话，那么推荐用let*。比如说我先赋值r，然后赋值面积等于2 * pai*r，那么第二个赋值就依赖于第二个。这种情况用let就会出现错误。但是编程一般用let，为了竟可能减少程序间的依赖关系，方便理解
</p>
</div>
</div>



<div class="outline-3">
<h3 id="orgheadline31">基本lisp链表操作元函数</h3>
<div class="outline-text-3" id="text-2-20">
<p>
也就是car cdr caddr 之类的，elisp同样也是支持的。
</p>

<p>
(cadr '(1 2 3))
=&gt; 2
</p>

<p>
cadr 等于 second 
</p>

<p>
(second '(1 2 3))
</p>

<p>
caddr 等于 third 
</p>

<p>
(third '(1 2 3))
=&gt; 3
</p>

<p>
然后 cons list append 函数，这些也是很基本的，elisp同样也支持。
</p>

<p>
cons这个命令就是创建cons cell结构，通常用于把元素添加到列表头上。
(cons "a" '("b" "c"))
=&gt; ("a" "b" "c")
</p>


<p>
list命令就是创建一个列表，将这些元素用括号包围起来:
(list 1 2 3)
=&gt; (1 2 3)
</p>

<p>
append命令用于往列表后面加入某个元素:
(append '(5 4) '(3))
=&gt; (5 4 3)
需要注意的是第二个元素必须是列表，所以append命令对应可以看作python中的两个列表的extend或者+操作。
</p>

<p>
值得一提的是append命令第二个元素如果不是列表，而是一个元素的话，程序不会出错，而是返回这样的dot list。
(append '("a") 1)
=&gt; ("a" . 1)
</p>

<p>
这可以用于构建alist，然后cons命令如果第二个参数是元素，构建的也是这样的dot list:
(cons "a" 1)
=&gt; ("a" . 1) 
</p>

<p>
然后append命令第一个元素必须是列表，否则会出现错误。
(append 'a '(b c))&#x2014;&gt;error!!
</p>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline35">alist和plist</h3>
<div class="outline-text-3" id="text-2-21">
<p>
alist是这样的结构:
alist  ((key1 . value1)
  (key2 . value2)
  (key3 . value3))
</p>

<p>
plist 是这样的结构:
plist 
(key1 value1
  key2 value2
  key3 value3)
</p>

<p>
参看了 <a href="http://www.emacswiki.org/emacs/AlistVsPlist">这个网页</a> ，alist可以简单来模拟类似python语言的字典结构，但如果需要考虑效率了，则推荐使用hash table结构。然后plist一般推荐在key不变的情况下使用。
</p>
</div>


<div class="outline-4">
<h4 id="orgheadline32">plist-get</h4>
<div class="outline-text-4" id="text-2-21-1">
<p>
提取plist的某个值:
(plist-get '(foo 4) 'foo)
=&gt; 4
</p>
</div>
</div>

<div class="outline-4">
<h4 id="orgheadline33">assoc</h4>
<div class="outline-text-4" id="text-2-21-2">
<p>
提取alist的某个值:
(assoc 'key alist)
</p>
</div>
</div>

<div class="outline-4">
<h4 id="orgheadline34">assq</h4>
<div class="outline-text-4" id="text-2-21-3">
<p>
assq  alist的配套查询函数  类似 assoc 只是用 'eq' 替代了 'equal'
</p>
</div>
</div>
</div>



<div class="outline-3">
<h3 id="orgheadline36">reverse函数</h3>
<div class="outline-text-3" id="text-2-22">
<p>
reverse函数，列表翻转函数，这里强调的是列表的第一层元素:
(reverse '((a b) (c d) (e f)))
=&gt; ((e f) (c d) (a b))
</p>

<p>
(reverse '(1 2 3))
=&gt; (3 2 1)
</p>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline37">nth</h3>
<div class="outline-text-3" id="text-2-23">
<p>
提取列表的第几个元素:
(nth 0 '(a b c))
=&gt; a
</p>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline38">nthcdr</h3>
<div class="outline-text-3" id="text-2-24">
<p>
cdr命令我们是知道的，nth就是做几次cdr命令。所以做0次就是原列表，做一次cdr等等。
需要注意的就是：
(cdr nil)
=&gt; nil
</p>

<p>
也就是对空列表cdr还是空列表，所以如果cdr过头了就会得到nil，但是有一个例外，那就是dotted list。
因为dotted list是以一个元素作结尾，这样将会导致错误。因为cdr只能对列表进行操作。
(nthcdr 2 '(a b c))
=&gt; (c)
</p>
</div>
</div>


<div class="outline-3">
<h3 id="orgheadline39">last</h3>
<div class="outline-text-3" id="text-2-25">
<p>
last返回的是列表的最后一个cons cell结构。
(last nil)&#x2014;&gt;nil
</p>

<p>
对于正常的列表就是返回最后一个元素，不过是加了列表符号的。
(last '(a b c))&#x2014;&gt;(c)
</p>

<p>
对于dotted list则是所谓的最后一个cons cell:
(last '("a" . 1)) -&gt; '("a" . 1)
这是因为(c) 的完整结构是 [c|nil] 
</p>
</div>
</div>


<div class="outline-3">
<h3 id="orgheadline40">remove</h3>
<div class="outline-text-3" id="text-2-26">
<p>
remove就是把某个列表中出现的某个元素给移去。
(remove 'a '(b a n a n a))&#x2014;&gt;(b n n)
</p>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline47">集合相关函数</h3>
<div class="outline-text-3" id="text-2-27">
</div><div class="outline-4">
<h4 id="orgheadline41">member</h4>
<div class="outline-text-4" id="text-2-27-1">
<p>
member函数的作用就是核对某个value值是不是在后面列表中。如果是那么返回真值，包括开始为真的那个值也包括后面的元素。是假那么返回nil。
</p>
</div>
</div>

<div class="outline-4">
<h4 id="orgheadline42">intersection</h4>
<div class="outline-text-4" id="text-2-27-2">
<p>
交集
</p>
</div>
</div>
<div class="outline-4">
<h4 id="orgheadline43">union</h4>
<div class="outline-text-4" id="text-2-27-3">
<p>
补集
</p>
</div>
</div>
<div class="outline-4">
<h4 id="orgheadline44">set-difference</h4>
<div class="outline-text-4" id="text-2-27-4">
<p>
差集
</p>
</div>
</div>

<div class="outline-4">
<h4 id="orgheadline45">subsetp</h4>
<div class="outline-text-4" id="text-2-27-5">
<p>
判断第一个集合是不是第二个集合的子集，是就返回T，这里是确定的t。假返回nil。
</p>
</div>
</div>

<div class="outline-4">
<h4 id="orgheadline46">set-exclusive-or</h4>
<div class="outline-text-4" id="text-2-27-6">
<p>
XOR逻辑
</p>
</div>
</div>
</div>
</div>


<div class="outline-2">
<h2 id="orgheadline76">elisp进阶</h2>
<div class="outline-text-2" id="text-3">
</div><div class="outline-3">
<h3 id="orgheadline49">current-buffer</h3>
<div class="outline-text-3" id="text-3-1">
<p>
(current-buffer)
返回目前的buffer对象，(buffer-name)返回的只是当前buffer的名字。
</p>
</div>
</div>


<div class="outline-3">
<h3 id="orgheadline50">other-buffer</h3>
<div class="outline-text-3" id="text-3-2">
<p>
(other-buffer)
下一个buffer对象
</p>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline51">switch-to-buffer</h3>
<div class="outline-text-3" id="text-3-3">
<p>
编辑器切换buffer，这个函数是面向用户的，elisp程序员推荐使用 set-buffer。
(switch-to-buffer (other-buffer))
</p>

<p>
对应的快捷键是 C-x b
</p>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline52">buffer-size</h3>
<div class="outline-text-3" id="text-3-4">
<p>
(buffer-size)
当前buffer的size
</p>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline53">point对象</h3>
<div class="outline-text-3" id="text-3-5">
<p>
(point)
</p>

<p>
(point)其返回的(point)计数是从buffer的开始到目前cursor所做所包含的字符数。
12185  &#x2013; 12196 = 11 （这显示中文字符也是只占一个字符位，奇怪。）
</p>

<p>
(point-min)  1 一般都是1
(point-max)
</p>

<p>
通常用 (point-min) 到 (point-max) 来选中整个buffer的文本内容。
</p>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline54">interactive</h3>
<div class="outline-text-3" id="text-3-6">
<p>
(interactive)
</p>

<p>
这样你定义函数就可以通过 M-x 来执行了。在minibuffer下的回显可以通过 message 函数来做到。
</p>

<p>
如果是最简单的命令不需要输入参数，那么直接写上 (interactive) 即可，如果需要输入参数，具体情况很复杂，请参看 <a href="http://www.gnu.org/software/emacs/manual/html_node/elisp/Using-Interactive.html">这个网页</a> 。
</p>

<p>
用prefix argument，比如下面这种写法:
</p>
<pre>
(defun multiply-by-seven (number)
"Multiply NUMBER by seven."
(interactive "p") 
(message "The result is %d" (* 7 number)))
</pre>

<p>
这里的小写字母 p 的意思是接受一个prefix 参数，数值型。或者大写字母 P（raw prefix argument）。然后具体使用是 <code>C-u 5 M-x commond</code> 。
</p>

<p>
这种用法我不太喜欢，还有一种参数定义方法，如下所示:
</p>
<div class="highlight"><pre><span class="p">(</span><span class="nb">defun</span> <span class="nv">multiply-by-seven</span> <span class="p">(</span><span class="nc">number</span><span class="p">)</span>
<span class="s">&quot;Multiply NUMBER by seven.&quot;</span>
<span class="p">(</span><span class="nv">interactive</span> <span class="s">&quot;nplease input a number:\n&quot;</span><span class="p">)</span> 
<span class="p">(</span><span class="nv">message</span> <span class="s">&quot;The result is %d&quot;</span> <span class="p">(</span><span class="nb">*</span> <span class="mi">7</span> <span class="nc">number</span><span class="p">)))</span>
</pre></div>

<p>
这里的第一个字母 <code>n</code> 的意思是接受一个数值参数，然后后面的字符都是提示信息文字， <code>\n</code> 表示结束，若要再定义一个参数则继续写:
</p>


<div class="highlight"><pre><span class="p">(</span><span class="nb">defun</span> <span class="nv">multiply-by-seven</span> <span class="p">(</span><span class="nc">number</span> <span class="nv">str</span><span class="p">)</span>
<span class="s">&quot;Multiply NUMBER by seven.&quot;</span>
<span class="p">(</span><span class="nv">interactive</span> <span class="s">&quot;nplease input a number:\nsplease input a string:\n&quot;</span><span class="p">)</span> 
<span class="p">(</span><span class="nv">message</span> <span class="s">&quot;The result is %d&quot;</span> <span class="p">(</span><span class="nb">*</span> <span class="mi">7</span> <span class="nc">number</span><span class="p">))</span>
<span class="p">(</span><span class="nv">message</span> <span class="s">&quot;your input is: %s&quot;</span> <span class="nv">str</span><span class="p">))</span>
</pre></div>

<p>
当然一般用户接口不推荐很多参数，最多一个参数就有了。
</p>
</div>
</div>
