电脑/emacs/elisp学习笔记.org
** save-excursion
It saves the location of point and mark

C-SPC (set-mark-command). If a mark has been set, you can use the
command C-x C-x (exchange-point-and-mark)
set-mark-command

The mark is another position in the buffer; its value can be set with a com-
mand such as C-SPC (set-mark-command). If a mark has been set, you can use the
command C-x C-x (exchange-point-and-mark) to cause the cursor to jump to the
mark and set the mark to be the previous position of point. In addition, if you set
another mark, the position of the previous mark is saved in the mark ring. Many
mark positions can be saved this way. You can jump the cursor to a saved mark by
typing C-u C-SPC one or more times.
The part of the buffer between point and mark is called the region. Numerous
commands work on the region, including center-region, count-lines-region,
kill-region, and print-region.


In addition to recording the values of point and mark, save-excursion keeps
track of the current buffer, and restores it, too. This means you can write code that
will change the buffer and have save-excursion switch you back to the original
buffer.
In Emacs Lisp code, a save-excursion expression often occurs within the body
of a let expression. It looks like this:
(let varlist
(save-excursion
body...))





** next-line
跳到下一行 对应快捷键 C-n

** mark-whole-buffer
也就是编辑器的全选命令。对应快捷键 C-x h

** subst

** sublis


** funcall

** mapcar

** lambda
 
** find-if

** remove-if-not

** remove-if

** reduce

** every


** incf

** decf

** push 

** pop

** when

** unless



** dotimes 和dolist函数



这篇文章介绍了的函数有：
factorial ----阶乘函数
fibonnaci-----斐波拉契数列函数
insert  ------插入函数
arrange  -----排列函数
while和until  宏



;;;while macro
(defmacro while (test  &rest body)
  `(do ()
       ((not ,test))
       ,@body))

;;;until macro
(defmacro until (test &rest body)
  `(do ()
       (,test)
       ,@body))




** 理解递归

> (defun our-member (obj lst)
   (if (null lst)
       nil
   (if (eql (car lst) obj)
       lst
       (our-member obj (cdr lst)))))
OUR-MEMBER

(defun median (list)
       (let ((sortlist (sort list #'<))
         (long (length list)))
         (if (oddp long) (nth (/ (- long 1) 2) sortlist) 
         (/ (+ (nth (- (/ long 2) 1) sortlist ) (nth (/ long 2) sortlist)) 2.0)))) 

defparameter




* 定义自己的包

(defun p (x y)
                          (cond  ((zerop y) 1)
                                     ((= y (1- x)) 1)
                                     (t  (+ (p (1- x) (1- y)) (p (1- x) y)))))



(defun pascal (n)
                          (loop  for  i  from 0  to (1- n)
                               collect (p n i)))

(defun pascal-triangle (x)
                          (loop for i from 1 to x
                             for s = '(1) then (pascal i)
                                 do  (format t "~&~s" s)))



(defmacro show-series (f a z &optional (step 1))
  `(loop for n from ,a to ,z by ,step
for y = ,f
collect y ))



(defmacro sum (f a z &optional (step 1))
  `(loop for n from ,a to ,z by ,step
for y = ,f
collect y into lst
finally (return (reduce #'+ lst))))


(defmacro product (f a z &optional (step 1))
  `(loop for n from ,a to ,z by ,step
for y = ,f
collect y into lst
finally (return (reduce #'* lst))))

(defmacro sum (f x a b &optional (step 1))
  `(loop for ,x from ,a to ,b by ,step
for y = ,f
collect y into lst
finally (return (reduce #'+ lst)))


 (defmacro show-series (f x a z &optional (step 1))
  `(loop for ,x from ,a to ,z by ,step
for y = ,f
collect y ))
(defmacro product (f x a z &optional (step 1))
   `(loop for ,x from ,a to ,z by ,step
for y = ,f
 collect y into lst
 finally (return (reduce #'* lst))))

 (defmacro s-integrate (f x a b &optional (n 100))
`(let ((h (/ (- ,b ,a) ,n)))
  (* (* h 1/3) 
     (+ 
(let ((,x ,a)) 
    ,f)
      (* 4 (sum ,f ,x (+ ,a h) ,b (* 2 h)))
      (* 2 (sum ,f ,x (+ ,a (* 2 h)) (- ,b h) (* 2 h)))
(let ((,x ,b))
  ,f)))))




* 附录
** emacs中使用common-lisp
在deb系系统中推荐直接用apt-get安装之:
#+BEGIN_SRC bash
apt-get install slime
#+END_SRC

这样安装之后连配置都不用配置了，直接输入 ~M-x slime~ 即可，不过你可能还没有装一个common-lisp的解释器，gnu的 ~clisp~ 或者 ~sbcl~ 都还行吧。

** 命令行执行emacs里面的命令
参考了 [[http://stackoverflow.com/questions/22072773/batch-export-of-org-mode-files-from-the-command-line][这个网页]] 。

如下所示，将以batch批处理模式加载test.org，然后执行命令"org-html-export-to-html" 。然后这里的 ~-u~ 是指定以某个用户的身份来运行emacs（主要是一些配置文件相关）。
#+BEGIN_SRC emacs-lisp
emacs test.org -u "$(id -un)" --batch  -f org-html-export-to-html
#+END_SRC

** 参考资料
1. COMMON LISP: A Gentle Introduction to Symbolic Computation ; Author: David S. Touretzky
2. [[http://acl.readthedocs.org/en/latest/][ANSI Common Lisp 中文]] 

#+BEGIN_EXAMPLE
(add-to-list 'load-path "~/workspace/myemacs/myorg/org")
(require 'org)
#+END_EXAMPLE

 add-to-list
#+BEGIN_SRC elisp
ELISP> (setq x nil)
nil
ELISP> (add-to-list 'x "a")
("a")

ELISP> x
("a")
#+END_SRC



我们常见的 load-path 就是emacs启动时搜索插件路径的列表，所以我们加入某个搜索路径有如下命令:


#+BEGIN_EXAMPLE
(add-to-list 'load-path "~/workspace/myemacs/myorg/org")
#+END_EXAMPLE

eval-after-load

eval-when-compile


declare-function

global-set-key

