电脑/emacs/elisp学习笔记.html


<div class="outline-3">
<h3 id="orgheadline55">save-excursion</h3>
<div class="outline-text-3" id="text-3-7">
<p>
It saves the location of point and mark
</p>

<p>
C-SPC (set-mark-command). If a mark has been set, you can use the
command C-x C-x (exchange-point-and-mark)
set-mark-command
</p>

<p>
The mark is another position in the buffer; its value can be set with a com-
mand such as C-SPC (set-mark-command). If a mark has been set, you can use the
command C-x C-x (exchange-point-and-mark) to cause the cursor to jump to the
mark and set the mark to be the previous position of point. In addition, if you set
another mark, the position of the previous mark is saved in the mark ring. Many
mark positions can be saved this way. You can jump the cursor to a saved mark by
typing C-u C-SPC one or more times.
The part of the buffer between point and mark is called the region. Numerous
commands work on the region, including center-region, count-lines-region,
kill-region, and print-region.
</p>


<p>
In addition to recording the values of point and mark, save-excursion keeps
track of the current buffer, and restores it, too. This means you can write code that
will change the buffer and have save-excursion switch you back to the original
buffer.
In Emacs Lisp code, a save-excursion expression often occurs within the body
of a let expression. It looks like this:
(let varlist
(save-excursion
body&#x2026;))
</p>
</div>
</div>





<div class="outline-3">
<h3 id="orgheadline56">next-line</h3>
<div class="outline-text-3" id="text-3-8">
<p>
跳到下一行 对应快捷键 C-n
</p>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline57">mark-whole-buffer</h3>
<div class="outline-text-3" id="text-3-9">
<p>
也就是编辑器的全选命令。对应快捷键 C-x h
</p>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline58">subst</h3>
</div>

<div class="outline-3">
<h3 id="orgheadline59">sublis</h3>
</div>


<div class="outline-3">
<h3 id="orgheadline60">funcall</h3>
</div>

<div class="outline-3">
<h3 id="orgheadline61">mapcar</h3>
</div>

<div class="outline-3">
<h3 id="orgheadline62">lambda</h3>
</div>

<div class="outline-3">
<h3 id="orgheadline63">find-if</h3>
</div>

<div class="outline-3">
<h3 id="orgheadline64">remove-if-not</h3>
</div>

<div class="outline-3">
<h3 id="orgheadline65">remove-if</h3>
</div>

<div class="outline-3">
<h3 id="orgheadline66">reduce</h3>
</div>

<div class="outline-3">
<h3 id="orgheadline67">every</h3>
</div>


<div class="outline-3">
<h3 id="orgheadline68">incf</h3>
</div>

<div class="outline-3">
<h3 id="orgheadline69">decf</h3>
</div>

<div class="outline-3">
<h3 id="orgheadline70">push</h3>
</div>

<div class="outline-3">
<h3 id="orgheadline71">pop</h3>
</div>

<div class="outline-3">
<h3 id="orgheadline72">when</h3>
</div>

<div class="outline-3">
<h3 id="orgheadline73">unless</h3>
</div>



<div class="outline-3">
<h3 id="orgheadline74">dotimes 和dolist函数</h3>
<div class="outline-text-3" id="text-3-26">
<p>
这篇文章介绍了的函数有：
factorial -&#x2014;阶乘函数
fibonnaci&#x2013;&#x2014;斐波拉契数列函数
insert  &#x2014;&#x2014;插入函数
arrange  &#x2013;&#x2014;排列函数
while和until  宏
</p>



<p>
;;;while macro
(defmacro while (test  &amp;rest body)
  `(do ()
       ((not ,test))
       ,@body))
</p>

<p>
;;;until macro
(defmacro until (test &amp;rest body)
  `(do ()
       (,test)
       ,@body))
</p>
</div>
</div>




<div class="outline-3">
<h3 id="orgheadline75">理解递归</h3>
<div class="outline-text-3" id="text-3-27">
<p>
&gt; (defun our-member (obj lst)
   (if (null lst)
       nil
   (if (eql (car lst) obj)
       lst
       (our-member obj (cdr lst)))))
OUR-MEMBER
</p>

<p>
(defun median (list)
       (let ((sortlist (sort list #'&lt;))
         (long (length list)))
         (if (oddp long) (nth (/ (- long 1) 2) sortlist) 
         (/ (+ (nth (- (/ long 2) 1) sortlist ) (nth (/ long 2) sortlist)) 2.0)))) 
</p>

<p>
defparameter
</p>
</div>
</div>
</div>




<div class="outline-2">
<h2 id="orgheadline77">定义自己的包</h2>
<div class="outline-text-2" id="text-4">
<p>
(defun p (x y)
                          (cond  ((zerop y) 1)
                                     ((= y (1- x)) 1)
                                     (t  (+ (p (1- x) (1- y)) (p (1- x) y)))))
</p>



<p>
(defun pascal (n)
                          (loop  for  i  from 0  to (1- n)
                               collect (p n i)))
</p>

<p>
(defun pascal-triangle (x)
                          (loop for i from 1 to x
                             for s = '(1) then (pascal i)
                                 do  (format t "~&amp;~s" s)))
</p>



<p>
(defmacro show-series (f a z &amp;optional (step 1))
  `(loop for n from ,a to ,z by ,step
for y = ,f
collect y ))
</p>



<p>
(defmacro sum (f a z &amp;optional (step 1))
  `(loop for n from ,a to ,z by ,step
for y = ,f
collect y into lst
finally (return (reduce #'+ lst))))
</p>


<p>
(defmacro product (f a z &amp;optional (step 1))
  `(loop for n from ,a to ,z by ,step
for y = ,f
collect y into lst
finally (return (reduce #'* lst))))
</p>

<p>
(defmacro sum (f x a b &amp;optional (step 1))
  `(loop for ,x from ,a to ,b by ,step
for y = ,f
collect y into lst
finally (return (reduce #'+ lst)))
</p>


<p>
 (defmacro show-series (f x a z &amp;optional (step 1))
  `(loop for ,x from ,a to ,z by ,step
for y = ,f
collect y ))
(defmacro product (f x a z &amp;optional (step 1))
   `(loop for ,x from ,a to ,z by ,step
for y = ,f
 collect y into lst
 finally (return (reduce #'* lst))))
</p>

<p>
 (defmacro s-integrate (f x a b &amp;optional (n 100))
`(let ((h (/ (- ,b ,a) ,n)))
  (* (* h 1/3) 
     (+ 
(let ((,x ,a)) 
    ,f)
      (* 4 (sum ,f ,x (+ ,a h) ,b (* 2 h)))
      (* 2 (sum ,f ,x (+ ,a (* 2 h)) (- ,b h) (* 2 h)))
(let ((,x ,b))
  ,f)))))
</p>
</div>
</div>




<div class="outline-2">
<h2 id="orgheadline81">附录</h2>
<div class="outline-text-2" id="text-5">
</div><div class="outline-3">
<h3 id="orgheadline78">emacs中使用common-lisp</h3>
<div class="outline-text-3" id="text-5-1">
<p>
在deb系系统中推荐直接用apt-get安装之:
</p>
<div class="highlight"><pre>apt-get install slime
</pre></div>

<p>
这样安装之后连配置都不用配置了，直接输入 <code>M-x slime</code> 即可，不过你可能还没有装一个common-lisp的解释器，gnu的 <code>clisp</code> 或者 <code>sbcl</code> 都还行吧。
</p>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline79">命令行执行emacs里面的命令</h3>
<div class="outline-text-3" id="text-5-2">
<p>
参考了 <a href="http://stackoverflow.com/questions/22072773/batch-export-of-org-mode-files-from-the-command-line">这个网页</a> 。
</p>

<p>
如下所示，将以batch批处理模式加载test.org，然后执行命令"org-html-export-to-html" 。然后这里的 <code>-u</code> 是指定以某个用户的身份来运行emacs（主要是一些配置文件相关）。
</p>
<div class="highlight"><pre><span class="nv">emacs</span> <span class="nv">test.org</span> <span class="nv">-u</span> <span class="s">&quot;$(id -un)&quot;</span> <span class="nv">--batch</span>  <span class="nv">-f</span> <span class="nv">org-html-export-to-html</span>
</pre></div>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline80">参考资料</h3>
<div class="outline-text-3" id="text-5-3">
<ol class="org-ol">
<li>COMMON LISP: A Gentle Introduction to Symbolic Computation ; Author: David S. Touretzky</li>
<li><a href="http://acl.readthedocs.org/en/latest/">ANSI Common Lisp 中文</a></li>
</ol>

<pre>
(add-to-list 'load-path "~/workspace/myemacs/myorg/org")
(require 'org)
</pre>

<p>
add-to-list
</p>
<div class="highlight"><pre><span class="nv">ELISP&gt;</span> <span class="p">(</span><span class="k">setq</span> <span class="nv">x</span> <span class="no">nil</span><span class="p">)</span>
<span class="no">nil</span>
<span class="nv">ELISP&gt;</span> <span class="p">(</span><span class="nv">add-to-list</span> <span class="ss">&#39;x</span> <span class="s">&quot;a&quot;</span><span class="p">)</span>
<span class="p">(</span><span class="s">&quot;a&quot;</span><span class="p">)</span>

<span class="nv">ELISP&gt;</span> <span class="nv">x</span>
<span class="p">(</span><span class="s">&quot;a&quot;</span><span class="p">)</span>
</pre></div>



<p>
我们常见的 load-path 就是emacs启动时搜索插件路径的列表，所以我们加入某个搜索路径有如下命令:
</p>


<pre>
(add-to-list 'load-path "~/workspace/myemacs/myorg/org")
</pre>

<p>
eval-after-load
</p>

<p>
eval-when-compile
</p>


<p>
declare-function
</p>

<p>
global-set-key
</p>
</div>
</div>
</div>
</div>
</body>
</html>
